IDEA StatiCa Open Model
ConcreteCheckResultOverall Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Concrete check result
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultOverall
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConcreteCheckResultOverall
Public Class ConcreteCheckResultOverall
public ref class ConcreteCheckResultOverall
The ConcreteCheckResultOverall type exposes the following members.
Constructors
Name | Description
ConcreteCheckResultOverall
 Constructor
Top
Properties
Name | Description
Checks
 All check by the type
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace